22-authorization/snack-tracker/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_current_user
        # memoization
        if @current_user
            return @current_user
        else
            @current_user = User.find_by(id: session[:user_id])