21-sessions-and-cookies/snack-tracker/app/controllers/sessions_controller.rb

  def create

    # get the user from the database
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "victoria"], ["LIMIT", 1]]