23-authorization/snack-tracker/app/views/favorites/new.html.erb

SELECT "snacks".* FROM "snacks"
SELECT  1 AS one FROM "snacks" INNER JOIN "favorites" ON "snacks"."id" = "favorites"."snack_id" WHERE "favorites"."user_id" = ? AND "snacks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
---
        <div>
            <%= check_box_tag "snack_ids[]", s.id, checked = get_current_user.snacks.include?(s) %>