19-rails-validations/snack-tracker/app/controllers/snacks_controller.rb

  def index
    if params[:retailer_id]
      retailer = Retailer.find(params[:retailer_id])
      @snacks = retailer.snacks
    else
      @snacks = Snack.all
---
SELECT  "retailers".* FROM "retailers" WHERE "retailers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "snacks".* FROM "snacks" WHERE "snacks"."retailer_id" = ?  [["retailer_id", 3]]

  def create
    snack = Snack.create(snack_params)
---
INSERT INTO "snacks" ("name", "calories", "deliciousness", "created_at", "updated_at", "retailer_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Everlasting Gobstoppers"], ["calories", 1], ["deliciousness", 100], ["created_at", "2019-06-12 13:52:09.952179"], ["updated_at", "2019-06-12 13:52:09.952179"], ["retailer_id", 4]]

  def update # put/patch request
    @snack.update(snack_params)
---
UPDATE "snacks" SET "retailer_id" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["retailer_id", 4], ["updated_at", "2019-06-12 14:15:23.437822"], ["id", 13]]

  def destroy
    @snack.destroy
---
DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 9]]

  def find_snack
    @snack = Snack.find(params[:id])
---
SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]