23-authorization/snack-tracker/app/controllers/favorites_controller.rb

SELECT "snacks".* FROM "snacks"
---
  def new
    if get_current_user
        redirect_to login_path
    end
    @snacks = Snack.all

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "snacks".* FROM "snacks" INNER JOIN "favorites" ON "snacks"."id" = "favorites"."snack_id" WHERE "favorites"."user_id" = ?  [["user_id", 1]]
SELECT  1 AS one FROM "snacks" INNER JOIN "favorites" ON "snacks"."id" = "favorites"."snack_id" WHERE "favorites"."user_id" = ? AND "snacks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
---
  def create
    snack_ids = params[:snack_ids] # [1, 4, 5,]
    snack_ids.each do |id|
        snack = Snack.find(id)
        if !get_current_user.snacks.include?(snack)