23-authorization/snack-tracker/app/controllers/snacks_controller.rb

SELECT  "retailers".* FROM "retailers" WHERE "retailers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "snacks".* FROM "snacks" WHERE "snacks"."retailer_id" = ?  [["retailer_id", 3]]
---
  def index
    if params[:retailer_id]
      retailer = Retailer.find(params[:retailer_id])
      @snacks = retailer.snacks
    else
      @snacks = Snack.all