23-authorization/snack-tracker/app/controllers/snacks_controller.rb

  def index
    if session[:user_id]
      @user = User.find(session[:user_id])
      @snacks = @user.snacks
    else
      @snacks = Snack.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "snacks".* FROM "snacks" INNER JOIN "favorites" ON "snacks"."id" = "favorites"."snack_id" WHERE "favorites"."user_id" = ?  [["user_id", 1]]

  def create
    @snack = Snack.new(snack_params)
    if @snack.valid?
      @snack.save
---
INSERT INTO "snacks" ("name", "calories", "deliciousness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Twinkies"], ["calories", 200], ["deliciousness", 1], ["created_at", "2019-06-12 14:20:29.502637"], ["updated_at", "2019-06-12 14:20:29.502637"]]

  def update # put/patch request
    if @snack.valid?
      @snack.update(snack_params)
---
UPDATE "snacks" SET "retailer_id" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["retailer_id", 4], ["updated_at", "2019-06-12 14:15:23.437822"], ["id", 13]]

  def destroy
    @snack.destroy
---
DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 9]]

  def find_snack
    @snack = Snack.find(params[:id])
---
SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]