18-rails-associations/snack-tracker/app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"
---
  def index
    @snacks = Snack.all

INSERT INTO "snacks" ("name", "calories", "deliciousness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Nachos"], ["calories", 700], ["deliciousness", 1], ["created_at", "2019-06-11 14:46:56.151764"], ["updated_at", "2019-06-11 14:46:56.151764"]]
---
  def create
    snack = Snack.create(snack_params)

UPDATE "snacks" SET "calories" = ?, "updated_at" = ? WHERE "snacks"."id" = ?  [["calories", 3000], ["updated_at", "2019-06-11 14:46:44.334828"], ["id", 2]]
---
  def update # put/patch request
    @snack.update(snack_params)

DELETE FROM "snacks" WHERE "snacks"."id" = ?  [["id", 2]]
---
  def destroy
    @snack.destroy

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_snack
    @snack = Snack.find(params[:id])